Tekla Open API Reference for Tekla Structures 2025
Mark.MarkAttributes.LoadAttributes Method
 Loads attributes from the attribute file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool LoadAttributes(
	string attributeFilename
)
Public Overrides Function LoadAttributes (
	attributeFilename As String
) As Boolean
Parameters
attributeFilename
Type: System.String
The filename of the attribute file.
Return Value
Type: Boolean
True on success.
See Also
Reference
Mark.MarkAttributes Class
Tekla.Structures.Drawing Namespace